---
kind: other
id: Methods.T:Autodesk.Revit.DB.IModelExportContext
source: html/9918cd23-908b-8b0a-af1a-cf2ceac9da3e.htm
---
# IModelExportContext Methods

This method is called when a Curve is being output.